{
  "welcome": "Welcome to Galaxy",
  "greeting": "Hello, {{name}}!",
  "connectWallet": "Connect Wallet",
  "betAmount": "Bet Amount",
  "balance": "Balance",
  "bet": "Bet",
  "approve": "Approve",
  "rewardInfo": "Reward Information",
  "claimedReward": "Claimed Reward",
  "pendingReward": "Pending Reward",
  "totalReward": "Total Reward",
  "rewardLimit": "Reward Limit",
  "claimReward": "Claim Reward",
  "inviteFriendReward": "Invite Friends to Earn Rewards",
  "betSuccess": "Bet Successful",
  "betFail": "Bet Failed",
  "approveSuccess": "Approval Successful",
  "approveFail": "Approval Failed",
  "claimSuccess": "Claim Successful",
  "claimFail": "Claim Failed",
  "copySuccess": "Copy Successful",
  "acceptInvitation": "Do you accept the invitation from {{address}}?",
  "cancel": "Cancel",
  "confirm": "Confirm",
  "bindSuccess": "Binding Successful",
  "bindFail": "Binding Failed",
  "claimTips": "*Only when the pending rewards are >={{amount}} {{name}} can they be claimed.",
  "shareTips": "Only by injecting funds can you invite.",
  "myInviter": "My Inviter",
  "alreadyAccepted": "Already accepted the invitation.",
  "alreadyStaked": "Already staked, can no longer accept invitations.",
  "participatedAmount": "Participated Amount",
  "accelerateEarnings": "Click to Accelerate Earnings",
  "earningsRecord": "Earnings Withdrawal Record",
  "withdrawalAmount": "Withdrawal Amount",
  "transactionHash": "Transaction Hash",
  "myTeam": "My Team",
  "directInvitation": "Direct Invitation",
  "totalEarnings": "Total Earnings",
  "invitationRewardRecord": "Invitation Reward Record",
  "address": "Address",
  "amount": "Amount",
  "time": "Time",
  "copyLink": "Copy Link",
  "home": "Home",
  "invite": "Invite",
  "noData": "No Data",
  "switchV1": "Beta Version V1",
  "switchV2": "Beta Version V2",
  "switchV3": "Official Version",
  "switch": "Beta Version",
  "invitationDetected": "A beta invitation relationship has been detected.",
  "confirmToBind": "Click to confirm and bind with one click.",
  "foundationIntroduction": "Introduction",
  "intro": {
    "backToHome": "Back to Home",
    "subtitle": ["Galaxy Century Foundation", "Legal and Compliant GALAXY"],
    "description": [
      "The Galaxy Century Foundation is the world's first online sharing platform focused on the junket business. Leveraging the powerful resources and technology of the Las Vegas Group Fund Management Company, it breaks the geographical limitations of the traditional gaming industry, organically integrating casinos, Texas Hold'em events, transaction data, and membership expansion systems.",
      "Galaxy Century is committed to providing a one-stop operation, data settlement, and cross-border client expansion service for the global junket community, building an efficient, transparent, and shared global gaming ecosystem.",
      "The Galaxy Century Foundation, supported by the Las Vegas Group Fund Management Company, strictly adheres to international gaming and financial laws and regulations, holding multiple internationally recognized licenses and certifications to ensure the platform's legality, safety, and compliance.",
      "U.S. Foundation License, MSB Financial License, U.S. Foundation License, MSB Financial License, Authorized by the U.S. Securities and Exchange Commission (SEC), Legally engaged in cross-border payments, Legally conducting global currency exchange and digital asset-related businesses, Foundation management and investment operations, Issued by the U.S. Department of the Treasury’s Financial Crimes Enforcement Network."
    ],
    "about": "Vegas Foundation is a globally leading innovative financial institution dedicated to providing innovative financial services and asset management solutions for the global casino and gaming industry. The core goal of the foundation is to promote transparency, security, and stable profitability in the gaming industry!",
    "team": "The founding team of Vegas Foundation includes globally renowned financial experts and an international professional operations team, committed to delivering high returns to partners and investors through its unique fund management system.",
    "details": "Detailed Description - PDF Download Link",
    "officialDapp": "Official DAPP",
    "contractAddress": "Contract Address"
  },
  "rebet": "Reinvestment is not open",
  "notice": "1.Starting from July 31, the daily profit rate is 2%; at the same time, daily profit rates of 5%, 4%, 3%, 2%, and 1% will be implemented in a seven-day cycle. The 5-4-3-2-1 cycle will distribute gambling profit dividends. Dynamic promotion doubles the static exit. The direct referral reward is 10%. Generation rewards are as follows: Refer 3 people to receive rewards for 3 generations; refer 5 people for 7 generations; refer 8 people for 10 generations; refer 10 people for 12 generations; refer 15 people for 15 generations (automatically activated upon meeting the referral threshold). While increasing the generation rewards, the profit level decreases by one tier. 2.The malicious account string intelligent identification and tracing system has been activated. Real-time scanning of fund-associated accounts is in place, and accounts flagged and restricted by the system cannot be manually unlocked. For more information, please follow the official Twitter updates. Wishing everyone a pleasant betting experience! Vegas Foundation Technical Department",
  "announcement": "Announcement",
  "totalAmount": "Total Amount Invested",
  "contactInfo": "Contact Information",
  "telegram": "Telegram",
  "twitter": "Twitter",
  "customerSupportEmail": "Customer Support Email"
}
